Revit 2024 API
ModelPathUtils.IsValidUserVisibleFullServerPath Method
 Determines whether the given string represents a valid server path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool IsValidUserVisibleFullServerPath(
	string strPath
)
Visual Basic
Public Shared Function IsValidUserVisibleFullServerPath ( _
	strPath As String _
) As Boolean
Visual C++
public:
static bool IsValidUserVisibleFullServerPath(
	String^ strPath
)
Parameters
strPath
Type: System.String
 The path, in string form
Return Value
 True if the given path is a valid server path, false otherwise.
Remarks
ServerPaths must refer to Revit models.
ServerPaths are relative to the central server location, and are of the form "RSN://{HostNodeName}/{model_path}".
The {model_path} portion is a relative path to a Revit model. For example:
RSN://EXS/hospital.rvt
RSN://EXS.autodesk.com/Old Files/hotel2.rvt
RSN://EXS.autodesk.com/Old Files/Last Week/Tuesday\hotel2.rvt
 are all valid server paths.
//EXS/Old Files/.rvt
EXS/hospital
 are not valid server paths. If this function returns false, it does not necessarily mean the given path is a file path. It may be a malformed string.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ModelPathUtils Class
Autodesk.Revit.DB Namespace